संख्याः = [u"शून्य" ,u"एकम:" ,u"द्वे" ,u"त्रीणि" ,u"चत्वारि" ,u"पञ्च" ,u"षट्" ,u"सप्त" ,u"अष्ट" ,u"नव" ,u"दश" ,u"एकादश" ,u"द्वादश" ,u"त्रयोदश" ,u"चतुर्दश" ,u"पञ्चदश" ,u"षोडश" ,u"सप्तदश" ,u"अष्टादश" ,u"नवदश" ,u"विंशतिः" ,u"एकविंशतिः" ,u"द्वाविंशतिः" ,u"त्रयोविंशतिः" ,u"चतुर्विंशतिः" ,u"पञ्चविंशतिः" ,u"षड्विंशतिः" ,u"सप्तविंशतिः" ,u"अष्टाविंशतिः" ,u"नवविंशतिः" ,u"त्रिंशत्" ,u"एकत्रिंशत्" ,u"द्वात्रिंशत्" ,u"त्रयस्त्रिंशत्" ,u"चतुस्त्रिंशत्" ,u"पञ्चत्रिंशत्" ,u"षट्त्रिंशत्" ,u"सप्तत्रिंशत्" ,u"अष्टत्रिंशत्" ,u"नवत्रिंशत्" ,u"चत्वारिंशत्" ,u"एकचत्वारिंशत्" ,u"द्विचत्वारिंशत्" ,u"त्रिचत्वारिंशत्" ,u"चतुश्चत्वारिंशत्" ,u"पञ्चचत्वारिंशत्" ,u"षट्चत्वारिंशत्" ,u"सप्तचत्वारिंशत्" ,u"अष्टचत्वारिंशत्" ,u"नवचत्वारिंशत्" ,u"पञ्चाशत्"]
# संचिका = open("गणकम्.संस्कृत","w")
संचिका = open(u"गणकम्.संस्कृत","r+",encoding="utf-8")
दत्तांश = संचिका.read()
संचिका.close()

वाक्य = दत्तांश.splitlines()

for क् in वाक्य:
    शब्दः = क्.split(" ")
    for पत्रम् in शब्दः:
        if पत्रम् in संख्याः:
            अनुक्रमणिका = संख्याः.index(पत्रम्);
            print(अनुक्रमणिका)
        
