def प्रत्याहारअर्थ(शब्दः):
    if एतत्प्रत्याहारअस्ति(शब्दः) == False:
        return ''
    प्रत्याहार = []
    संचिका = open(u"माहेश्वरसूत्र.संस्कृत","r+",encoding="utf-8")
    दत्तांश = संचिका.read()
    माहेश्वरसूत्र = दत्तांश.splitlines()
    संचिका.close()
    प्रारंभः = 0
    for सूत्र in माहेश्वरसूत्र:
        for पत्रम् in range(len(सूत्र)):
            if शब्दः[2] == सूत्र[पत्रम्] or सूत्र[पत्रम्] == '।':
                continue
            if शब्दः[0] == सूत्र[पत्रम्] and शब्दः[2] != सूत्र[पत्रम् + 1]:
                प्रारंभः = 1
            if शब्दः[1] == सूत्र[पत्रम्] and शब्दः[2] == सूत्र[पत्रम् + 1]:
                प्रारंभः = 0
                break  
            if (शब्दः[2] == सूत्र[पत्रम् + 1]):
                continue
            if प्रारंभः:
                प्रत्याहार.append(सूत्र[पत्रम्])
    return प्रत्याहार

def एतत्प्रत्याहारअस्ति(शब्दः):    
    संचिका = open(u"प्रत्याहार.संस्कृत","r+",encoding="utf-8")
    दत्तांश = संचिका.read()
    प्रत्याहार = दत्तांश.splitlines()
    संचिका.close()
    if शब्दः in प्रत्याहार:
        return True
    return False

if __name__ == "__main__":
    
    प्रत्याहार = एतत्प्रत्याहारअस्ति("शल")
    print(प्रत्याहार)